{
    "JSONMyPortfolioEvolution": [
        {
            "title":"Portfolio 2021",
            "info":[ 
                "This is the most recent version of my portfolio, in this version I believe not only a sample of interface design cases, but also explaining the process of layout, uploading and delivery. I began to divide the realization of this portfolio into the following stages:", 
                "- Interface design",
                "- Web structure (HTML / CSS / SASS / REACT)",
                "- Responsive Design (CSS GRID / FLEX)",
                "- Responsive for screen resolutions (PC / Laptop / Tablet / Smartphone)",
                "- Responsive for web browsers (Google Chrome / Safari / Firefox / Microsoft Edge)",
                "- Web animation (CSS KEYFRAME)",
                "In the first stage, what is the interface design, in this case, I used Adobe XD to pass the sketches to final wireframes, and then in the layout, it initialized the project in REACT implementing REACT HOOKS, later I uploaded the repository on the GitHub platform to keep it updated via console.",
                "I was creating each view within each branch, to keep a record of what was created within the same repository, after this we go to the responsive stage where we first apply responsive for different devices in terms of resolution (of course, create a style sheet there apart implementing SASS / CSS) then go to the next stage of responsive that would already be for different browsers there create a sheet for each browser and within that sheet implement a tag per browser, to specify what has to be modified for each browser so that as well as the illusion that it is 'rendering' the same in all, because not all browsers project the page in the same way because there are properties that as such do not support, so it is good to take those details into account also so that the page looks the same way in all browsers used.",
                "In this case, I used it in terms of screen resolution: PC / Laptop / Tablet / Smartphone; and for browsers: Google Chrome / Safari / Firefox / Microsoft Edge. Finally, we go to the stage of assembling the text and images of the project, tell the information. Them, we would miss the part of the animation that in this case opts to make the character animation via frame by frame using css keyframes."
            ],
            "img":[
                "2021-1.png",
                "2021-2.png",
                "2021-3.png",
                "2021-4.png",
                "2021-5.png",
                "2021-6.png"
            ]
        },
        {
            "title":"Portfolio 2019",
            "info":[ 
                "In this version I wanted to orient it exclusively for user interface design for customer acquisition; I presented three cases of the most recent teeth that I have had in terms of creating the navigation flow of your system, the UI / KIT (which would be the creation of the elements, components) and the results that each Project produced. The technologies used were the same as the previous one, say PHP, HTML, CSS and BOOTSTRAP."
            ],
            "img":[
                "2019-1.png",
                "2019-2.png",
                "2019-3.png",
                "2019-4.png",
                "2019-5.png",
                "2019-6.png"
            ]
        },
        {
            "title":"Portfolio 2018",
            "info":[ 
                "About that version I wanted to do something different, here I implemented a kind of portfolio / blog where I posted my opinions and advice on design, I started portfolio and implemented PHP for the first time, mostly to replicate the menu and the footer."
            ],
            "img":[
                "2018-1.png",
                "2018-2.png",
                "2018-3.png"
            ]
        },
        {
            "title":"Portfolio 2017",
            "info":[ 
                "About that version I used another design, in that moment I thinked it was cool and modern, but I was wrong jeje, but that's part of grow!."
            ],
            "img":[
                "2017-1.png",
                "2017-2.png",
                "2017-3.png",
                "2017-4.png"
            ]
        },
        {
            "title":"Portfolio 2015",
            "info":[ 
                "This version of the portfolio is one of the oldest that I have had, I started this portfolio by implementing a free template and modifying it to show designs mostly oriented to show a basic profile of my person, my skills and my contact data (because I was starting ). In general, this portfolio was my initiation of the layout as such; I did not implement much, only HTML, CSS and BOOTSTRAP."
            ],
            "img":[
                "2015-1.png",
                "2015-2.png",
                "2015-3.png",
                "2015-4.png"
            ]
        }
    ]
}